In [10]:
# Importing Libraries
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt

# Loading Data
dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()

# Data Cleanup
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])


ðŸŸ© Drop Missing Values (2.3.1) - Problem
Pandas Data Management
Problem Statement:

Create a copy of the DataFrame and drop rows where the salary_year_avg column has missing values. Display the first 5 rows of the cleaned DataFrame.
Hint:

Use the copy() method to create a copy of the DataFrame and the dropna() method to drop rows with missing values.

In [3]:
df_clean = df.copy()

df_clean = df_clean.dropna(subset='salary_year_avg')
df_clean['salary_year_avg']

28        109500.0
77        140000.0
92        120000.0
100       228222.0
109        89000.0
            ...
785624    139216.0
785641    150000.0
785648    221875.0
785682    157500.0
785692    157500.0
Name: salary_year_avg, Length: 22003, dtype: float64


ðŸŸ© Random Sample of DataFrame (2.3.2) - Problem
Pandas Data Management
Problem Statement:

Create a new DataFrame that is a random sample of 10% of the original DataFrame. Display the first 5 rows of the sampled DataFrame.
Hint:

Use the sample() method to create a random sample of the DataFrame.

In [8]:
df_sample = df.copy()
df_sample = df_sample.sample(frac=0.1)
df_sample.head()

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
318960,Data Analyst,Clinical Data Analyst I,"Petaling Jaya, Selangor, Malaysia",via BeBee Malaysia,Full-time,False,Malaysia,2023-02-14 17:43:37,True,False,Malaysia,None,NaN,NaN,Parexel,None,None
120802,Data Engineer,Data Engineer,Anywhere,via LinkedIn,Full-time,True,India,2023-05-30 08:11:30,False,False,India,None,NaN,NaN,fifthnote-An Ensemble Health Partners Company,"['t-sql', 'sql', 'python', 'sql server', 'azur...","{'cloud': ['azure', 'databricks'], 'databases'..."
755893,Data Engineer,data engineer,"Kempton Park, South Africa",via BeBee South Africa,Full-time,False,South Africa,2023-03-05 20:24:53,False,False,South Africa,None,NaN,NaN,Professional Career Services,"['sql', 'r', 'azure', 'ssis', 'power bi', 'exc...","{'analyst_tools': ['ssis', 'power bi', 'excel'..."
2463,Data Engineer,Data Engineer,"Herndon, VA",via LinkedIn,Full-time,False,"Texas, United States",2023-03-13 13:13:02,False,False,United States,None,NaN,NaN,Idexcel,"['python', 'nosql', 'sql', 'snowflake', 'aws',...","{'cloud': ['snowflake', 'aws'], 'libraries': [..."
767724,Data Engineer,Data Engineer: Transform,"Bloomington, IL",via Jobs Trabajo.org,Full-time,False,"Illinois, United States",2023-12-19 01:01:17,False,False,United States,None,NaN,NaN,Insight Global,"['python', 'sql', 'r', 'azure', 'snowflake', '...","{'cloud': ['azure', 'snowflake', 'databricks']..."


ðŸŸ¨ Fill Missing Salaries (2.3.3) - Problem
Pandas Data Management
Problem Statement:

Create a copy of the original DataFrame and fill in missing values in the salary_year_avg column with the median salary. Display the first 5 rows of the altered DataFrame.
Hint:

Use the copy() method to create a copy of the DataFrame and the fillna() method to fill in missing values.

In [9]:
df_filled = df.copy()

df_filled.fillna({'salary_year_avg': df['salary_year_avg'].median()}, inplace=True)
df_filled.head()

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
0,Senior Data Engineer,Senior Clinical Data Engineer / Principal Clin...,"Watertown, CT",via Work Nearby,Full-time,False,"Texas, United States",2023-06-16 13:44:15,False,False,United States,None,115000.0,NaN,Boehringer Ingelheim,None,None
1,Data Analyst,Data Analyst,"Guadalajara, Jalisco, Mexico",via BeBee MÃ©xico,Full-time,False,Mexico,2023-01-14 13:18:07,False,False,Mexico,None,115000.0,NaN,Hewlett Packard Enterprise,"['r', 'python', 'sql', 'nosql', 'power bi', 't...","{'analyst_tools': ['power bi', 'tableau'], 'pr..."
2,Data Engineer,"Data Engineer/Scientist/Analyst, Mid or Senior...","Berlin, Germany",via LinkedIn,Full-time,False,Germany,2023-10-10 13:14:55,False,False,Germany,None,115000.0,NaN,ALPHA Augmented Services,"['python', 'sql', 'c#', 'azure', 'airflow', 'd...","{'analyst_tools': ['dax'], 'cloud': ['azure'],..."
3,Data Engineer,LEAD ENGINEER - PRINCIPAL ANALYST - PRINCIPAL ...,"San Antonio, TX",via Diversity.com,Full-time,False,"Texas, United States",2023-07-04 13:01:41,True,False,United States,None,115000.0,NaN,Southwest Research Institute,"['python', 'c++', 'java', 'matlab', 'aws', 'te...","{'cloud': ['aws'], 'libraries': ['tensorflow',..."
4,Data Engineer,Data Engineer- Sr Jobs,"Washington, DC",via Clearance Jobs,Full-time,False,Sudan,2023-08-07 14:29:36,False,False,Sudan,None,115000.0,NaN,Kristina Daniel,"['bash', 'python', 'oracle', 'aws', 'ansible',...","{'cloud': ['oracle', 'aws'], 'other': ['ansibl..."